In [1]:
import pandas as pd

In [20]:
df=pd.read_csv('e:/EXCEL WORK/russian_passenger_air_service.csv')

In [21]:
df

,Airport name,Year,January,February,March,April,May,June,July,August,September,October,November,December,Whole year,Airport coordinates
0,Abakan,2020,43.58,0.00,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,"(Decimal('91.399735'), Decimal('53.751351'))"
1,Aikhal,2020,0.00,0.00,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,"(Decimal('111.543324'), Decimal('65.957161'))"
2,Loss,2020,0.00,0.00,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,"(Decimal('125.398355'), Decimal('58.602489'))"
3,Amderma,2020,0.00,0.00,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,"(Decimal('61.577429'), Decimal('69.759076'))"
4,Anadyr (Carbon),2020,122.00,0.00,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,"(Decimal('177.738273'), Decimal('64.713433'))"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3956,Yakutsk,2007,583.70,707.80,851.80,1018.00,950.80,900.0,1154.90,1137.84,1485.50,1382.50,1488.00,1916.60,13577.44,"(Decimal('129.750225'), Decimal('62.086594'))"
3957,Yakutsk (Magan),2007,0.00,0.00,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,"(Decimal('-6.226888'), Decimal('8.607871'))"
3958,Yamburg,2007,3.55,0.16,3.37,5.32,4.31,6.3,6.88,3.60,4.13,4.93,4.17,8.87,55.59,"(Decimal('75.097783'), Decimal('67.980026'))"
3959,Yaroslavl (Tunoshna),2007,847.00,1482.90,1325.40,1235.97,629.00,838.0,1211.30,915.00,1249.60,1650.50,1822.60,2055.60,15262.87,"(Decimal('40.170054'), Decimal('57.56231'))"
3960,Yartsevo,2007,0.00,0.00,0.00,0.00,0.00,0.0,0.00,0.00,0.00,0.00,0.00,0.00,0.00,"(Decimal('90.203907'), Decimal('60.252931'))"

In [22]:
df.head(2)

,Airport name,Year,January,February,March,April,May,June,July,August,September,October,November,December,Whole year,Airport coordinates
0,Abakan,2020,43.58,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,"(Decimal('91.399735'), Decimal('53.751351'))"
1,Aikhal,2020,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,"(Decimal('111.543324'), Decimal('65.957161'))"

In [23]:
df.info

<bound method DataFrame.info of               Airport name  Year  January  February    March    April     May  \
0                   Abakan  2020    43.58      0.00     0.00     0.00    0.00
1                   Aikhal  2020     0.00      0.00     0.00     0.00    0.00
2                     Loss  2020     0.00      0.00     0.00     0.00    0.00
3                  Amderma  2020     0.00      0.00     0.00     0.00    0.00
4          Anadyr (Carbon)  2020   122.00      0.00     0.00     0.00    0.00
...                    ...   ...      ...       ...      ...      ...     ...
3956               Yakutsk  2007   583.70    707.80   851.80  1018.00  950.80
3957       Yakutsk (Magan)  2007     0.00      0.00     0.00     0.00    0.00
3958               Yamburg  2007     3.55      0.16     3.37     5.32    4.31
3959  Yaroslavl (Tunoshna)  2007   847.00   1482.90  1325.40  1235.97  629.00
3960              Yartsevo  2007     0.00      0.00     0.00     0.00    0.00

       June     July   August  September  October  November  December  \
0       0.0     0.00     0.00       0.00     0.00      0.00      0.00
1       0.0     0.00     0.00       0.00     0.00      0.00      0.00
2       0.0     0.00     0.00       0.00     0.00      0.00      0.00
3       0.0     0.00     0.00       0.00     0.00      0.00      0.00
4       0.0     0.00     0.00       0.00     0.00      0.00      0.00
...     ...      ...      ...        ...      ...       ...       ...
3956  900.0  1154.90  1137.84    1485.50  1382.50   1488.00   1916.60
3957    0.0     0.00     0.00       0.00     0.00      0.00      0.00
3958    6.3     6.88     3.60       4.13     4.93      4.17      8.87
3959  838.0  1211.30   915.00    1249.60  1650.50   1822.60   2055.60
3960    0.0     0.00     0.00       0.00     0.00      0.00      0.00

      Whole year                            Airport coordinates
0           0.00   (Decimal('91.399735'), Decimal('53.751351'))
1           0.00  (Decimal('111.543324'), Decimal('65.957161'))
2           0.00  (Decimal('125.398355'), Decimal('58.602489'))
3           0.00   (Decimal('61.577429'), Decimal('69.759076'))
4           0.00  (Decimal('177.738273'), Decimal('64.713433'))
...          ...                                            ...
3956    13577.44  (Decimal('129.750225'), Decimal('62.086594'))
3957        0.00    (Decimal('-6.226888'), Decimal('8.607871'))
3958       55.59   (Decimal('75.097783'), Decimal('67.980026'))
3959    15262.87    (Decimal('40.170054'), Decimal('57.56231'))
3960        0.00   (Decimal('90.203907'), Decimal('60.252931'))

[3961 rows x 16 columns]>

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.dtypes

Airport name            object
Year                     int64
January                float64
February               float64
March                  float64
April                  float64
May                    float64
June                   float64
July                   float64
August                 float64
September              float64
October                float64
November               float64
December               float64
Whole year             float64
Airport coordinates     object
dtype: object

# Sub Settings

In [28]:
country_df=df[['Airport name','January','August','Whole year','June']]

In [29]:
country_df.head(2)

  Airport name  January  August  Whole year  June
0       Abakan    43.58     0.0         0.0   0.0
1       Aikhal     0.00     0.0         0.0   0.0

In [35]:
df.isnull().sum()

Airport name           0
Year                   0
January                0
February               0
March                  0
April                  0
May                    0
June                   0
July                   0
August                 0
September              0
October                0
November               0
December               0
Whole year             0
Airport coordinates    0
dtype: int64

In [54]:
df_is=df.apply(lambda x:True if x['Whole year']=='30.00' else False,axis=1)

In [55]:
df_is

0       False
1       False
2       False
3       False
4       False
        ...
3956    False
3957    False
3958    False
3959    False
3960    False
Length: 3961, dtype: bool

In [48]:
df_is.iloc[2000]

False

In [56]:
len(df_is[df_is==False].index)

3961

In [57]:
df.shape

(3961, 16)

In [65]:
len(df[df['Whole year']==0.00])

3057

# melting the table

In [70]:
df_melt=df.melt(id_vars=['Airport name','Airport coordinates','Whole year','Year'],var_name='Months',value_name='Sale')

In [71]:
df_melt.head(2)

,Airport name,Airport coordinates,Whole year,Year,Months,Sale
0,Abakan,"(Decimal('91.399735'), Decimal('53.751351'))",0.0,2020,January,43.58
1,Aikhal,"(Decimal('111.543324'), Decimal('65.957161'))",0.0,2020,January,0.00

In [72]:
df_melt.shape

(47532, 6)

In [73]:
df_melt.dropna()

,Airport name,Airport coordinates,Whole year,Year,Months,Sale
0,Abakan,"(Decimal('91.399735'), Decimal('53.751351'))",0.00,2020,January,43.58
1,Aikhal,"(Decimal('111.543324'), Decimal('65.957161'))",0.00,2020,January,0.00
2,Loss,"(Decimal('125.398355'), Decimal('58.602489'))",0.00,2020,January,0.00
3,Amderma,"(Decimal('61.577429'), Decimal('69.759076'))",0.00,2020,January,0.00
4,Anadyr (Carbon),"(Decimal('177.738273'), Decimal('64.713433'))",0.00,2020,January,122.00
...,...,...,...,...,...,...
47527,Yakutsk,"(Decimal('129.750225'), Decimal('62.086594'))",13577.44,2007,December,1916.60
47528,Yakutsk (Magan),"(Decimal('-6.226888'), Decimal('8.607871'))",0.00,2007,December,0.00
47529,Yamburg,"(Decimal('75.097783'), Decimal('67.980026'))",55.59,2007,December,8.87
47530,Yaroslavl (Tunoshna),"(Decimal('40.170054'), Decimal('57.56231'))",15262.87,2007,December,2055.60
47531,Yartsevo,"(Decimal('90.203907'), Decimal('60.252931'))",0.00,2007,December,0.00